Revit.Elements.ForgeType.InternalForgeTypeId
Internal reference to Revit ForgeTypeId

Revit.Elements.ForgeType.#ctor(System.String)
Init ForgeType with typeId of a ForgeTypeId
typeId:

Revit.Elements.ForgeType.#ctor(Autodesk.Revit.DB.ForgeTypeId)
Init ForgeType with an existing ForgeTypeId
forgeTypeId:

Revit.Elements.ForgeType.InternalSetForgeType(Autodesk.Revit.DB.ForgeTypeId)
Set the internal ForgeTypeId
forgeTypeId:

Revit.Elements.ForgeType.TypeId
The schema identifier.

Revit.Elements.ForgeType.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.